__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, None, None, 3 0
__________________________________________________________________________________________________
separable_conv2d_1 (SeparableCo (None, None, None, 1 75          input_1[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, None, 1 64          separable_conv2d_1[0][0]
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, None, None, 1 0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, None, None, 1 0           leaky_re_lu_1[0][0]
__________________________________________________________________________________________________
separable_conv2d_2 (SeparableCo (None, None, None, 3 656         max_pooling2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, None, 3 128         separable_conv2d_2[0][0]
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, None, None, 3 0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, None, None, 3 0           leaky_re_lu_2[0][0]
__________________________________________________________________________________________________
separable_conv2d_3 (SeparableCo (None, None, None, 6 2336        max_pooling2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, None, 6 256         separable_conv2d_3[0][0]
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, None, None, 6 0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, None, None, 6 0           leaky_re_lu_3[0][0]
__________________________________________________________________________________________________
separable_conv2d_4 (SeparableCo (None, None, None, 1 8768        max_pooling2d_3[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, None, 1 512         separable_conv2d_4[0][0]
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, None, None, 1 0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, None, None, 1 0           leaky_re_lu_4[0][0]
__________________________________________________________________________________________________
separable_conv2d_5 (SeparableCo (None, None, None, 2 33920       max_pooling2d_4[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, None, 2 1024        separable_conv2d_5[0][0]
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, None, None, 2 0           batch_normalization_5[0][0]
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, None, None, 2 0           leaky_re_lu_5[0][0]
__________________________________________________________________________________________________
separable_conv2d_6 (SeparableCo (None, None, None, 5 133376      max_pooling2d_5[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, None, 5 2048        separable_conv2d_6[0][0]
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, None, None, 5 0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, None, None, 5 0           leaky_re_lu_6[0][0]
__________________________________________________________________________________________________
separable_conv2d_7 (SeparableCo (None, None, None, 1 528896      max_pooling2d_6[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, None, None, 1 4096        separable_conv2d_7[0][0]
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, None, None, 1 0           batch_normalization_7[0][0]
__________________________________________________________________________________________________
separable_conv2d_8 (SeparableCo (None, None, None, 2 263168      leaky_re_lu_7[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, None, None, 2 1024        separable_conv2d_8[0][0]
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, None, None, 2 0           batch_normalization_8[0][0]
__________________________________________________________________________________________________
separable_conv2d_11 (SeparableC (None, None, None, 1 33024       leaky_re_lu_8[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, None, None, 1 512         separable_conv2d_11[0][0]
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, None, None, 1 0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, None, None, 1 0           leaky_re_lu_10[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, None, 3 0           up_sampling2d_1[0][0]
                                                                 leaky_re_lu_5[0][0]
__________________________________________________________________________________________________
separable_conv2d_9 (SeparableCo (None, None, None, 5 133376      leaky_re_lu_8[0][0]
__________________________________________________________________________________________________
separable_conv2d_12 (SeparableC (None, None, None, 2 101760      concatenate_1[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, None, None, 5 2048        separable_conv2d_9[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, None, None, 2 1024        separable_conv2d_12[0][0]
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, None, None, 5 0           batch_normalization_9[0][0]
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, None, None, 2 0           batch_normalization_11[0][0]
__________________________________________________________________________________________________
separable_conv2d_10 (SeparableC (None, None, None, 2 131327      leaky_re_lu_9[0][0]
__________________________________________________________________________________________________
separable_conv2d_13 (SeparableC (None, None, None, 2 65791       leaky_re_lu_11[0][0]
==================================================================================================
Total params: 1,449,209
Trainable params: 1,442,841
Non-trainable params: 6,368